In [1]:
import pandas as pd

In [2]:
df=pd.read_csv("D:/Datasets/Titanic.csv")

In [3]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
y=df["Survived"]

1. Extract Features <br/>
a. Features and target should not have null values<br/>
b. Features should be numeric in nature<br/>
c. Features should be of the type array/ dataframe<br/>
d. Features should have some rows and some columns<br/>

2. Split the dataset into training and testing datasets<br/>
e. Features should be on the same scale<br/>
3. Train the model on the training dataset<br/>
4. Test the model on the testing dataset<br/>

# 1

In [5]:
X=df.drop("Survived",axis=1)

In [6]:
X.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [7]:
X=X.drop(["PassengerId","Name","Ticket","Embarked"],axis=1)

In [8]:
X.head()

   Pclass     Sex   Age  SibSp  Parch     Fare Cabin
0       3    male  22.0      1      0   7.2500   NaN
1       1  female  38.0      1      0  71.2833   C85
2       3  female  26.0      0      0   7.9250   NaN
3       1  female  35.0      1      0  53.1000  C123
4       3    male  35.0      0      0   8.0500   NaN

In [9]:
X.isna().sum()

Pclass      0
Sex         0
Age       177
SibSp       0
Parch       0
Fare        0
Cabin     687
dtype: int64

In [10]:
X.shape

(891, 7)

In [11]:
X=X.drop("Cabin",axis=1)

In [12]:
X.head()

   Pclass     Sex   Age  SibSp  Parch     Fare
0       3    male  22.0      1      0   7.2500
1       1  female  38.0      1      0  71.2833
2       3  female  26.0      0      0   7.9250
3       1  female  35.0      1      0  53.1000
4       3    male  35.0      0      0   8.0500

In [13]:
X.isna().sum()

Pclass      0
Sex         0
Age       177
SibSp       0
Parch       0
Fare        0
dtype: int64

In [14]:
X["Age"]=X["Age"].fillna(X["Age"].mean())

In [15]:
X.isna().sum()

Pclass    0
Sex       0
Age       0
SibSp     0
Parch     0
Fare      0
dtype: int64

In [16]:
y.isna().sum()

0

In [17]:
X.dtypes

Pclass      int64
Sex        object
Age       float64
SibSp       int64
Parch       int64
Fare      float64
dtype: object

In [18]:
X=pd.get_dummies(X,columns=["Sex"],drop_first=True)

In [19]:
X.head()

   Pclass   Age  SibSp  Parch     Fare  Sex_male
0       3  22.0      1      0   7.2500         1
1       1  38.0      1      0  71.2833         0
2       3  26.0      0      0   7.9250         0
3       1  35.0      1      0  53.1000         0
4       3  35.0      0      0   8.0500         1

In [20]:
type(X)

pandas.core.frame.DataFrame

In [21]:
X.shape

(891, 6)

# 2

In [22]:
from sklearn.model_selection import train_test_split

In [23]:
X_train,X_test,y_train,y_test=train_test_split(X,y,test_size=0.1,random_state=42,stratify=y)

In [24]:
X.head()

   Pclass   Age  SibSp  Parch     Fare  Sex_male
0       3  22.0      1      0   7.2500         1
1       1  38.0      1      0  71.2833         0
2       3  26.0      0      0   7.9250         0
3       1  35.0      1      0  53.1000         0
4       3  35.0      0      0   8.0500         1

In [25]:
from sklearn.preprocessing import MinMaxScaler

In [26]:
scaler=MinMaxScaler()

In [27]:
X_train=scaler.fit_transform(X_train)

In [28]:
X_test=scaler.transform(X_test)

# 3

In [29]:
from sklearn.linear_model import LogisticRegression

In [30]:
model=LogisticRegression()

In [31]:
model.fit(X_train,y_train)

LogisticRegression()

# 4

In [32]:
model.score(X_test,y_test)

0.7888888888888889

# Predict

In [33]:
data=pd.DataFrame({"First":[7],"Second":[1],"Three":["Rohan Walekar"],"Fourth":["Female"],"Fifth":[22],
                  "Sixth":[2],"Seventh":[3],"Eight":["AC 34343"],"Ninth":[71],"Tenth":["C324"],"Eleventh":["S"]})

In [34]:
data

,First,Second,Three,Fourth,Fifth,Sixth,Seventh,Eight,Ninth,Tenth,Eleventh
0,7,1,Rohan Walekar,Female,22,2,3,AC 34343,71,C324,S

In [35]:
data=data.drop(["First","Three","Eight","Tenth","Eleventh"],axis=1)

In [36]:
data

   Second  Fourth  Fifth  Sixth  Seventh  Ninth
0       1  Female     22      2        3     71

In [37]:
data=pd.get_dummies(data,columns=["Fourth"])

In [38]:
data

   Second  Fifth  Sixth  Seventh  Ninth  Fourth_Female
0       1     22      2        3     71              1

In [39]:
data.loc[0,"Fourth_Female"]=0

In [40]:
data

   Second  Fifth  Sixth  Seventh  Ninth  Fourth_Female
0       1     22      2        3     71              0

In [41]:
data=scaler.transform(data)

In [42]:
model.predict(data)

array([1], dtype=int64)